Австралия/src/ChartsOfCharacteristicTypes/ManagerialAnalyticalDimensionTypes/ManagerialAnalyticalDimensionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ManagerialAnalyticalDimensionTypes</name>
  <type>
    <types>DocumentRef.InventoryWriteOff</types>
    <types>DocumentRef.RegistersCorrection</types>
    <types>DocumentRef.FixedAssetSale</types>
    <types>CatalogRef.DiscountCardsTemplates</types>
    <types>CatalogRef.DiscountConditions</types>
    <types>CatalogRef.DefaultAccounts</types>
    <types>CatalogRef.ContainerTypes</types>
    <types>CatalogRef.Currencies</types>
    <types>CatalogRef.CustomerAcquisitionChannels</types>
    <types>DocumentRef.SalesInvoice</types>
    <types>DocumentRef.AccountSalesFromConsignee</types>
    <types>DocumentRef.ReconciliationStatement</types>
    <types>CatalogRef.UserDefinedFinancialReportIndicators</types>
    <types>DocumentRef.Transformation</types>
    <types>DocumentRef.RetailRevaluation</types>
    <types>CatalogRef.CashRegisters</types>
    <types>DocumentRef.TaxInvoiceReceived</types>
    <types>DocumentRef.InventoryTransfer</types>
    <types>CatalogRef.TaxTypes</types>
    <types>CatalogRef.CashFlowItems</types>
    <types>CatalogRef.ProductSegments</types>
    <types>CatalogRef.ContractForms</types>
    <types>DocumentRef.SupplierInvoice</types>
    <types>CatalogRef.ShippingAddresses</types>
    <types>CatalogRef.BillsOfMaterials</types>
    <types>DocumentRef.ProductReturn</types>
    <types>CatalogRef.Positions</types>
    <types>CatalogRef.Banks</types>
    <types>DocumentRef.FixedAssetsDepreciation</types>
    <types>DocumentRef.OutgoingEmail</types>
    <types>DocumentRef.SalesTarget</types>
    <types>DocumentRef.SubcontractorInvoiceReceived</types>
    <types>DocumentRef.EmployeeTask</types>
    <types>CatalogRef.BusinessUnits</types>
    <types>DocumentRef.PlannedInteraction</types>
    <types>CatalogRef.CampaignActivities</types>
    <types>DocumentRef.FixedAssetUsage</types>
    <types>CatalogRef.Teams</types>
    <types>CatalogRef.FinancialReportsTypes</types>
    <types>CatalogRef.LabelsAndTagsTemplates</types>
    <types>CatalogRef.Incoterms</types>
    <types>DocumentRef.TransferOrder</types>
    <types>CatalogRef.DirectDebitMandates</types>
    <types>CatalogRef.PriceTypes</types>
    <types>CatalogRef.WorkSchedules</types>
    <types>CatalogRef.Mapping</types>
    <types>DocumentRef.TaxAccrual</types>
    <types>CatalogRef.WorkOrderStatuses</types>
    <types>CatalogRef.ExternalUsers</types>
    <types>CatalogRef.SubscriptionPlans</types>
    <types>DocumentRef.ForeignCurrencyExchange</types>
    <types>DocumentRef.CustomsDeclaration</types>
    <types>CatalogRef.SerialNumbersTemplates</types>
    <types>CatalogRef.ContactPersons</types>
    <types>CatalogRef.Campaigns</types>
    <types>CatalogRef.CounterpartiesAccessGroups</types>
    <types>DocumentRef.SubcontractorOrderIssued</types>
    <types>CatalogRef.RMAStatuses</types>
    <types>CatalogRef.DocumentTypes</types>
    <types>DocumentRef.PaymentExpense</types>
    <types>DocumentRef.ManufacturingOverheadsRates</types>
    <types>DocumentRef.SalesSlip</types>
    <types>CatalogRef.AccountingTransactionsTemplates</types>
    <types>DocumentRef.IncomingEmail</types>
    <types>CatalogRef.LinesOfBusiness</types>
    <types>DocumentRef.FixedAssetRecognition</types>
    <types>CatalogRef.RoutingTemplates</types>
    <types>CatalogRef.MagneticCardsTemplates</types>
    <types>DocumentRef.PhoneCall</types>
    <types>DocumentRef.RequisitionOrder</types>
    <types>DocumentRef.OtherExpenses</types>
    <types>CatalogRef.Products</types>
    <types>CatalogRef.DefaultAccountsTypes</types>
    <types>CatalogRef.CounterpartyContracts</types>
    <types>CatalogRef.CompanyResources</types>
    <types>DocumentRef.InventoryReservation</types>
    <types>DocumentRef.CashTransferPlan</types>
    <types>DocumentRef.DebitNote</types>
    <types>DocumentRef.CashInflowForecast</types>
    <types>DocumentRef.ExpenseReport</types>
    <types>DocumentRef.FixedAssetDepreciationChanges</types>
    <types>DocumentRef.WorkcentersAvailability</types>
    <types>CatalogRef.SuppliersProducts</types>
    <types>DocumentRef.CashReceipt</types>
    <types>CatalogRef.SubcontractorOrderIssuedStatuses</types>
    <types>DocumentRef.Manufacturing</types>
    <types>CatalogRef.Leads</types>
    <types>DocumentRef.SalesOrder</types>
    <types>CatalogRef.BatchSettings</types>
    <types>CatalogRef.FinancialReportsItems</types>
    <types>DocumentRef.SubcontractorOrderReceived</types>
    <types>DocumentRef.GoodsReceipt</types>
    <types>CatalogRef.ProductsCharacteristics</types>
    <types>DocumentRef.Pricing</types>
    <types>DocumentRef.ProductionOrder</types>
    <types>CatalogRef.SubcontractorOrderReceivedStatuses</types>
    <types>CatalogRef.BankAccounts</types>
    <types>DocumentRef.CreditNote</types>
    <types>CatalogRef.BankClassifier</types>
    <types>CatalogRef.BarcodeScanningActions</types>
    <types>DocumentRef.SubcontractorInvoiceIssued</types>
    <types>CatalogRef.UserGroups</types>
    <types>CatalogRef.SerialNumbers</types>
    <types>CatalogRef.ChartsOfAccounts</types>
    <types>DocumentRef.Production</types>
    <types>CatalogRef.UOMClassifier</types>
    <types>CatalogRef.PaymentCardTypes</types>
    <types>CatalogRef.CounterpartySegments</types>
    <types>DocumentRef.IntraWarehouseTransfer</types>
    <types>CatalogRef.AutomaticDiscountTypes</types>
    <types>CatalogRef.ActivityTypes</types>
    <types>DocumentRef.Quote</types>
    <types>CatalogRef.ProductionTaskSuspendReasons</types>
    <types>DocumentRef.CostAllocation</types>
    <types>DocumentRef.BankReconciliation</types>
    <types>CatalogRef.ProductsBatches</types>
    <types>DocumentRef.WeeklyTimesheet</types>
    <types>DocumentRef.Meeting</types>
    <types>CatalogRef.LeadRejectionReasons</types>
    <types>CatalogRef.PurchaseOrderStatuses</types>
    <types>CatalogRef.Individuals</types>
    <types>CatalogRef.ProductsCategories</types>
    <types>CatalogRef.SupplierPriceTypes</types>
    <types>CatalogRef.InventoryOwnership</types>
    <types>CatalogRef.FixedAssets</types>
    <types>DocumentRef.Payroll</types>
    <types>DocumentRef.TerminationOfEmployment</types>
    <types>CatalogRef.LegalForms</types>
    <types>CatalogRef.HSCodes</types>
    <types>CatalogRef.CashierWorkplaceSettings</types>
    <types>CatalogRef.TransferOrderStatuses</types>
    <types>DocumentRef.FinancialReportInstance</types>
    <types>CatalogRef.VATRates</types>
    <types>CatalogRef.AccountingEntriesCategories</types>
    <types>CatalogRef.UOM</types>
    <types>CatalogRef.AnalyticalDimensionsSets</types>
    <types>DocumentRef.EmploymentContract</types>
    <types>CatalogRef.POSTerminals</types>
    <types>CatalogRef.IntegrationComponents</types>
    <types>CatalogRef.ContactPersonsRoles</types>
    <types>DocumentRef.Event</types>
    <types>DocumentRef.ShiftClosure</types>
    <types>CatalogRef.TaxReports</types>
    <types>DocumentRef.PackingSlip</types>
    <types>CatalogRef.CashAccounts</types>
    <types>CatalogRef.LegalDocuments</types>
    <types>CatalogRef.ManufacturingActivities</types>
    <types>DocumentRef.ManufacturingOperation</types>
    <types>DocumentRef.AccountingTransaction</types>
    <types>CatalogRef.Cells</types>
    <types>CatalogRef.PriceLists</types>
    <types>CatalogRef.BatchTrackingPolicies</types>
    <types>CatalogRef.FinancialReportsSets</types>
    <types>CatalogRef.DuplicateRules</types>
    <types>CatalogRef.Users</types>
    <types>CatalogRef.TypesOfAccounting</types>
    <types>CatalogRef.Companies</types>
    <types>CatalogRef.EDIProfiles</types>
    <types>DocumentRef.ExpenditureRequest</types>
    <types>CatalogRef.AccountingEntriesTemplates</types>
    <types>DocumentRef.LetterOfAuthority</types>
    <types>DocumentRef.VATInvoiceForICT</types>
    <types>CatalogRef.TransformationTemplates</types>
    <types>CatalogRef.ProductionOrderStatuses</types>
    <types>CatalogRef.WorldCountries</types>
    <types>CatalogRef.SalesTaxRates</types>
    <types>CatalogRef.BankStatementProcessingSettings</types>
    <types>CatalogRef.SalesTerritories</types>
    <types>DocumentRef.ActualSalesVolume</types>
    <types>DocumentRef.CashTransfer</types>
    <types>DocumentRef.AccountSalesToConsignor</types>
    <types>CatalogRef.Counterparties</types>
    <types>DocumentRef.OnlineReceipt</types>
    <types>DocumentRef.Operation</types>
    <types>CatalogRef.KitOrderStatuses</types>
    <types>CatalogRef.PriceGroups</types>
    <types>CatalogRef.BankCharges</types>
    <types>CatalogRef.EstimatesTemplates</types>
    <types>DocumentRef.SMSMessage</types>
    <types>DocumentRef.Timesheet</types>
    <types>DocumentRef.CashVoucher</types>
    <types>CatalogRef.CostDrivers</types>
    <types>CatalogRef.EarningAndDeductionTypes</types>
    <types>DocumentRef.RequestForQuotation</types>
    <types>DocumentRef.PurchaseOrder</types>
    <types>CatalogRef.Projects</types>
    <types>DocumentRef.LoanContract</types>
    <types>DocumentRef.ArApAdjustments</types>
    <types>CatalogRef.EarningsCalculationParameters</types>
    <types>CatalogRef.PayCodes</types>
    <types>CatalogRef.Tags</types>
    <types>DocumentRef.MonthEndClosing</types>
    <types>CatalogRef.EDocumentStatuses</types>
    <types>DocumentRef.Stocktaking</types>
    <types>DocumentRef.LoanInterestCommissionAccruals</types>
    <types>CatalogRef.JobAndEventStatuses</types>
    <types>CatalogRef.QuotationStatuses</types>
    <types>CatalogRef.CostPools</types>
    <types>DocumentRef.GoodsIssue</types>
    <types>CatalogRef.Peripherals</types>
    <types>CatalogRef.CostObjects</types>
    <types>CatalogRef.CounterpartyContractTypes</types>
    <types>DocumentRef.Budget</types>
    <types>CatalogRef.Workplaces</types>
    <types>DocumentRef.BulkMail</types>
    <types>DocumentRef.PaymentReceipt</types>
    <types>DocumentRef.OnlinePayment</types>
    <types>CatalogRef.EventsSubjects</types>
    <types>DocumentRef.OpeningBalanceEntry</types>
    <types>CatalogRef.PaymentMethods</types>
    <types>CatalogRef.CompanyResourceTypes</types>
    <types>CatalogRef.HardwareDrivers</types>
    <types>DocumentRef.KitOrder</types>
    <types>CatalogRef.DiscountCards</types>
    <types>CatalogRef.DiscountTypes</types>
    <types>CatalogRef.IncomeAndExpenseItems</types>
    <types>CatalogRef.SalesOrderStatuses</types>
    <types>DocumentRef.RMARequest</types>
    <types>DocumentRef.FixedAssetWriteOff</types>
    <types>CatalogRef.PlanningPeriods</types>
    <types>DocumentRef.TaxInvoiceIssued</types>
    <types>DocumentRef.JobSheet</types>
    <types>CatalogRef.Employees</types>
    <types>CatalogRef.ProductionOrdersPriorities</types>
    <types>CatalogRef.PaymentTermsTemplates</types>
    <types>CatalogRef.Numerators</types>
    <types>CatalogRef.BundledServices</types>
    <types>DocumentRef.SupplierQuote</types>
    <types>CatalogRef.DefaultGLAccounts</types>
    <types>DocumentRef.AdditionalExpenses</types>
    <types>CatalogRef.TimeUOM</types>
    <types>DocumentRef.DirectDebit</types>
    <types>CatalogRef.DiscountCardTypes</types>
    <types>DocumentRef.ProductionTask</types>
    <types>CatalogRef.ExchangeWithOfflinePeripheralsRules</types>
    <types>DocumentRef.WorkOrder</types>
    <types>DocumentRef.InventoryIncrease</types>
    <types>CatalogRef.TaxReportTemplates</types>
    <types>CatalogRef.SalesGoalSettings</types>
    <types>DocumentRef.TransferAndPromotion</types>
    <types>DocumentRef.PayrollSheet</types>
  </type>
</mdclass:ChartOfCharacteristicTypes>

Австралия/src/Catalogs/AnalyticalDimensionsSets/AnalyticalDimensionsSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AnalyticalDimensionsSets</name>
  <tabularSections>
    <name>AnalyticalDimensions</name>
    <attributes>
      <name>AnalyticalDimension</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ManagerialAnalyticalDimensionTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/ChartsOfAccounts/MasterChartOfAccounts/MasterChartOfAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>MasterChartOfAccounts</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ManagerialAnalyticalDimensionTypes</extDimensionTypes>
  <attributes>
    <name>ChartOfAccounts</name>
    <type>
      <types>CatalogRef.ChartsOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseQuantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAnalyticalDimensions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticalDimensionsSet</name>
    <type>
      <types>CatalogRef.AnalyticalDimensionsSets</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAvailableForAllCompanies</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>StartDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AnalyticalDimensions</name>
    <attributes>
      <name>AnalyticalDimension</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ManagerialAnalyticalDimensionTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>Currency</name>
    <comment>Currency</comment>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Quantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Currency</name>
    <comment>Currency</comment>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Quantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Австралия/src/ChartsOfCharacteristicTypes/ManagerialAnalyticalDimensionTypes/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	
	If ValueIsFilled(Object.Ref) Then
		
		If Not WriteParameters.Property("NoCheckValueTypes") Then
			
			UsingParameters = CheckValueTypeChange();
			ShouldAskQuestion = UsingParameters.UsedInTemplates;
			
			If ShouldAskQuestion Then
				Cancel = True;
				CheckTypes(UsingParameters);
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region Private

&AtServer
Function CheckValueTypeChange()
	
	OldValue = Common.ObjectAttributeValue(Object.Ref, "ValueType");
	UsingParameters = New Structure("UsedInEntries, UsedInTemplates", False, False);
	
	If Object.ValueType <> OldValue Then
	
		Query = New Query;
		Query.Text = 
		"SELECT
		|	AnalyticalDimensionsSetsAnalyticalDimensions.Ref AS Ref
		|INTO TemporaryTableDimensionsSets
		|FROM
		|	Catalog.AnalyticalDimensionsSets.AnalyticalDimensions AS AnalyticalDimensionsSetsAnalyticalDimensions
		|WHERE
		|	AnalyticalDimensionsSetsAnalyticalDimensions.AnalyticalDimension = &AnalyticalDimension
		|
		|GROUP BY
		|	AnalyticalDimensionsSetsAnalyticalDimensions.Ref
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	MasterChartOfAccounts.Ref AS Ref,
		|	TemporaryTableDimensionsSets.Ref AS Set,
		|	MasterChartOfAccounts.Code AS Code,
		|	MasterChartOfAccounts.Description AS Description
		|INTO TemporaryTableChartsOfAccounts
		|FROM
		|	TemporaryTableDimensionsSets AS TemporaryTableDimensionsSets
		|		INNER JOIN ChartOfAccounts.MasterChartOfAccounts AS MasterChartOfAccounts
		|		ON TemporaryTableDimensionsSets.Ref = MasterChartOfAccounts.AnalyticalDimensionsSet
		|
		|GROUP BY
		|	MasterChartOfAccounts.Ref,
		|	TemporaryTableDimensionsSets.Ref,
		|	MasterChartOfAccounts.Code,
		|	MasterChartOfAccounts.Description
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT DISTINCT
		|	TemporaryTableDimensionsSets.Ref AS Ref,
		|	AnalyticalDimensionsSets.Ref AS Set,
		|	""AnalyticalDimensionSets"" AS Type,
		|	AnalyticalDimensionsSets.Code AS Code,
		|	AnalyticalDimensionsSets.Description AS Description
		|FROM
		|	TemporaryTableChartsOfAccounts AS TemporaryTableChartsOfAccounts
		|		INNER JOIN Catalog.AccountingEntriesTemplates.EntriesSimple AS AccountingEntriesTemplatesEntriesSimple
		|		ON (TemporaryTableChartsOfAccounts.Ref = AccountingEntriesTemplatesEntriesSimple.AccountDr
		|				OR TemporaryTableChartsOfAccounts.Ref = AccountingEntriesTemplatesEntriesSimple.AccountCr)
		|		LEFT JOIN Catalog.AnalyticalDimensionsSets AS AnalyticalDimensionsSets
		|		ON TemporaryTableChartsOfAccounts.Set = AnalyticalDimensionsSets.Ref,
		|	TemporaryTableDimensionsSets AS TemporaryTableDimensionsSets
		|
		|UNION ALL
		|
		|SELECT
		|	TemporaryTableChartsOfAccounts.Ref,
		|	TemporaryTableChartsOfAccounts.Set,
		|	""Accounts"",
		|	TemporaryTableChartsOfAccounts.Code,
		|	TemporaryTableChartsOfAccounts.Description
		|FROM
		|	TemporaryTableChartsOfAccounts AS TemporaryTableChartsOfAccounts
		|
		|UNION ALL
		|
		|SELECT
		|	AccountingEntriesTemplatesEntriesSimple.Ref,
		|	TemporaryTableChartsOfAccounts.Set,
		|	""AccountingEntriesTemplates"",
		|	AccountingEntriesTemplates.Code,
		|	AccountingEntriesTemplates.Description
		|FROM
		|	TemporaryTableChartsOfAccounts AS TemporaryTableChartsOfAccounts
		|		INNER JOIN Catalog.AccountingEntriesTemplates.EntriesSimple AS AccountingEntriesTemplatesEntriesSimple
		|			INNER JOIN Catalog.AccountingEntriesTemplates AS AccountingEntriesTemplates
		|			ON AccountingEntriesTemplatesEntriesSimple.Ref = AccountingEntriesTemplates.Ref
		|		ON (TemporaryTableChartsOfAccounts.Ref = AccountingEntriesTemplatesEntriesSimple.AccountDr
		|				OR TemporaryTableChartsOfAccounts.Ref = AccountingEntriesTemplatesEntriesSimple.AccountCr)
		|
		|UNION ALL
		|
		|SELECT
		|	AccountingEntriesTemplatesEntries.Ref,
		|	TemporaryTableChartsOfAccounts.Set,
		|	""AccountingEntriesTemplates"",
		|	AccountingEntriesTemplates.Code,
		|	AccountingEntriesTemplates.Description
		|FROM
		|	TemporaryTableChartsOfAccounts AS TemporaryTableChartsOfAccounts
		|		INNER JOIN Catalog.AccountingEntriesTemplates.Entries AS AccountingEntriesTemplatesEntries
		|			INNER JOIN Catalog.AccountingEntriesTemplates AS AccountingEntriesTemplates
		|			ON AccountingEntriesTemplatesEntries.Ref = AccountingEntriesTemplates.Ref
		|		ON TemporaryTableChartsOfAccounts.Ref = AccountingEntriesTemplatesEntries.Account
		|TOTALS
		|	MAX(Ref)
		|BY
		|	Type";
		
		Query.SetParameter("AnalyticalDimension", Object.Ref);
		QueryResult = Query.Execute();
		
		If Not QueryResult.IsEmpty() Then
			UsingParameters.Insert("UsedInTemplates", True);
		EndIf;
			
		UsingTree = QueryResult.Unload(QueryResultIteration.ByGroups);
		ValueToFormAttribute(UsingTree, "Using");
		
	EndIf;
	
	UsingParameters.Insert("OldValue", OldValue);
	
	Return UsingParameters;
	
EndFunction

&AtClient
Procedure CheckTypes(UsingParameters)
	
	Types = Object.ValueType.Types();
	OldTypes = UsingParameters.OldValue.Types();
	UsingObjectsString = "";
		
	AllTypesAreLeft = True;
	
	For Each OldType In OldTypes Do
		
		If Types.Find(OldType) = Undefined Then
			AllTypesAreLeft = False;
			Break;
		EndIf;
		
	EndDo;
	
	If AllTypesAreLeft Then
		
		QueryBoxText = StringFunctionsClientServer.SubstituteParametersToString(
			MessagesToUserClientServer.GetManagerialAnalyticalDimensionTypeLeftWarning(),
			Object.Ref);
			
		ShowQueryBox(New NotifyDescription("CheckTypesEnd", ThisObject, UsingParameters),
			QueryBoxText,
			QuestionDialogMode.YesNo);
	Else
		
		MessageText = StringFunctionsClientServer.SubstituteParametersToString(
			MessagesToUserClientServer.GetManagerialAnalyticalDimensionSaveErrorText(),
			Object.Ref);
		
		ShowUsing();
		ShowMessageBox(, MessageText)
		
	EndIf;
	
EndProcedure

&AtClient
Procedure CheckTypesEnd(ClosingResult, AdditionalParameters) Export
	
	If ClosingResult = DialogReturnCode.Yes Then
		
		ShowUsing();
		
		AdditionalParameters.Insert("NoCheckValueTypes", True);
		Write(AdditionalParameters);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ShowUsing()
	
	ClearMessages();
	
	For Each TypeRow In Using.GetItems() Do
		
		UsingType = GetUsingType(TypeRow.Ref);
		CommonClientServer.MessageToUser(UsingType + ":");
		
		For Each Row In TypeRow.GetItems() Do
			CommonClientServer.MessageToUser(Row.Code + ", " + Row.Description);
		EndDo;
		
	EndDo;
	
EndProcedure

&AtServerNoContext
Function GetUsingType(Ref)
	
	If TypeOf(Ref) = Type("ChartOfAccountsRef.MasterChartOfAccounts") Then
		Return NStr("en = 'Accounts'; ru = 'Счета учета';pl = 'Konta';es_ES = 'Cuentas';es_CO = 'Cuentas';tr = 'Hesaplar';it = 'Conti';de = 'Konten'");
	EndIf;
	
	Return Ref.Metadata().Synonym;
	
EndFunction

#EndRegion
